/****************************************************************************************
*@Copyrights  2014，中兴软创（南京）计算机有限公司 方案架构--QuickMDB小组
*@            All rights reserved.
*@Name：	   mdbBitMap.cpp		
*@Description：  bitmap的实现
*@Author:		jin.shaohua
*@Date：	    2014/03/27
*@History:
******************************************************************************************/
#include "mdbBitMap.h"
//namespace QuickMDB{
	template<int SIZE>
	TMdbBitMap::TMdbBitMap()
	{
		memset(m_sBM,0,sizeof(m_sBM));
	}
	/******************************************************************************
	* 函数名称	:  Clear
	* 函数描述	: 清理所有
	* 输入		:  
	* 输出		:  
	* 返回值	:  
	* 作者		:  jin.shaohua
	*******************************************************************************/
	template<int SIZE>
	void TMdbBitMap::Clear()
	{

	}
	/******************************************************************************
	* 函数名称	:  IsSet
	* 函数描述	: 某个位置是否设置了flag = true
	* 输入		:  
	* 输出		:  
	* 返回值	:  0 - 成功!0 -失败
	* 作者		:  jin.shaohua
	*******************************************************************************/
	template<int SIZE>
	bool TMdbBitMap::IsSet(int iPos)
	{
		return false;
	}
	/******************************************************************************
	* 函数名称	:  Set
	* 函数描述	: //设置某位置的flag true/false
	* 输入		:  
	* 输出		:  
	* 返回值	:  0 - 成功!0 -失败
	* 作者		:  jin.shaohua
	*******************************************************************************/
	template<int SIZE>
	void TMdbBitMap::Set(int iPos,bool bFlag)
	{

	}
//}